yooaroma/yoo_stm8s/src/TIM1/stm8s_tim1_main.c
      /* Reset the Output Compare Bits & Set the Output Compare Mode */
      TIM1->CCMR1 = (uint8_t)((uint8_t)(TIM1->CCMR1 & (uint8_t)(~TIM1_CCMR_OCM)) 
                              | (uint8_t)TIM1_OCMODE_PWM2); // TIM1_OCMODE_PWM2 = 0x70(112)
    }
    if(vbChannelNumber==TIM1_CHANNEL_1) // ch1
    {
      TIM1_SetCompare1(vwRatioReg);
      if(0)
      {
          /* Set the Capture Compare1 Register value */
          TIM1->CCR1H = (uint8_t)(vwRatioReg >> 8);
          TIM1->CCR1L = (uint8_t)(vwRatioReg);
      }
      TIM1_OC1PolarityConfig(vbLevelState);
      if(0)
      {
        TIM1->CCER1 |= TIM1_CCER1_CC1P; //  OC1 active low
      }
      TIM1_OC1NPolarityConfig(vbLevelState);
      if(0)
      {
        TIM1->CCER1 |= TIM1_CCER1_CC1NP;
      }
      TIM1_OC1PreloadConfig(ENABLE);
      if(0)
      {
        TIM1->CCMR1 |= TIM1_CCMR_OCxPE; // : Preload register on TIM1_CCR1 enabled
      }
    }
    else if(vbChannelNumber==TIM1_CHANNEL_2) // ch2
    {
      TIM1_SetCompare2(vwRatioReg);
      TIM1_OC2PolarityConfig(vbLevelState);
      TIM1_OC2NPolarityConfig(vbLevelState);
      TIM1_OC2PreloadConfig(ENABLE);
    }
    else if(vbChannelNumber==TIM1_CHANNEL_3) // ch3
    {
      TIM1_SetCompare3(vwRatioReg);
      TIM1_OC3PolarityConfig(vbLevelState);
      TIM1_OC3NPolarityConfig(vbLevelState);
      TIM1_OC3PreloadConfig(ENABLE);
    }
    else if(vbChannelNumber==TIM1_CHANNEL_4) // ch4
    {
      TIM1_SetCompare4(vwRatioReg);
      TIM1_OC4PolarityConfig(vbLevelState);
      // TIM1_OC4NPolarityConfig(vbLevelState);
      TIM1_OC4PreloadConfig(ENABLE);
    }
    if(vbPinUseFlag&0x1)
    {
      TIM1_CCxCmd(vbChannelNumber, ENABLE);
      if(0)
      {
        TIM1->CCER1 |= TIM1_CCER1_CC1E; // On - OC1 signal is output on the corresponding output pin depending on the MOE, OSSI, OSSR, OIS1, OIS1N and CC1NE bits
      }
    }
    if(vbPinUseFlag&0x2)
    {
      TIM1_CCxNCmd(vbChannelNumber, ENABLE);
      if(0)
      {        
        TIM1->CCER1 |= TIM1_CCER1_CC1NE;
      }
    }
    TIM1_ARRPreloadConfig(ENABLE);
    if(0)
    {
      TIM1->CR1 |= TIM1_CR1_ARPE; // TIM1_ARR register is buffered through a preload register
    }
    if(vbPulseState)
    {
      TIM1_SelectOnePulseMode(TIM1_OPMODE_SINGLE);
      // TIM1->CR1 |= TIM1_CR1_OPM;
      TIM1->EGR = 0xFF;
    }
    /* TIM1 Main Output Enable */
    TIM1_CtrlPWMOutputs(ENABLE);
    if(0)
    {
      TIM1->BKR |= TIM1_BKR_MOE; // OC and OCN outputs are enabled if their respective enable bits are set (CCiE in TIM1_CCERi registers).
    }
    /* TIM1 counter enable */
    TIM1_Cmd(ENABLE);
    if(0)
    {
      TIM1->CR1 |= TIM1_CR1_CEN; // Counter enabled
    }
  }
#endif

  return 1;
}
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
/*
  Period = Count * Tclock = Count * ((Pscr+1)/fMasterClock)
  Period Max < 2 ^ (N + 1) 
  ((Pscr+1)/fMasterClock) = 2 ^ M 
  Count Max < 2 ^ 16

  2 ^ (N + 1) = 2 ^ 16 * 2 ^ M = 2 ^ (16 + M)
  N + 1 = 16 + M
  M = N - 15
  ((Pscr+1)/fMasterClock) = 2 ^ M 

  Pscr = (2 ^ M) * fMasterClock - 1;
  Count = Period >> M;
*/
#define _MM_CK_PSC_   (16000000)  // fMASTER_CLOCK = 16MHz...
int mmTim1CalPscrCntr(uint32_t vdwDelayUsec, uint16_t *pvwPSCR, uint16_t *pvwCNTR)
{
  uint32_t vdwMask = vdwDelayUsec;
  uint8_t vbIndex = 0;
  uint8_t vbMaxBitDelay = 0;
  uint8_t vbPscrBitData = 0;
  {
    for (vbIndex = 0; vbIndex < 32; vbIndex++)
    {
      if (vdwMask & 0x80000000)
      {
        break;
      }
      vdwMask <<= 1;
    }
    vbMaxBitDelay = 31 - vbIndex;
    ccprintf(_DEBUG_CMD_A_, ("mmTim1CalPscrCntr : vbMaxBitDelay : %d\r\n", vbMaxBitDelay));
    if (vbMaxBitDelay <= 15)
    {
      vbMaxBitDelay = 15;
    }
    else if(vbMaxBitDelay >= (31-5)) // 2 ^ 5 = 32 > (_MM_CK_PSC_/1000000) =  16
    {      
      vbMaxBitDelay = 31-5;
    }
    vbPscrBitData = vbMaxBitDelay - 15;
    *pvwPSCR = (1 << vbPscrBitData) * (_MM_CK_PSC_/1000000) - 1;
    *pvwCNTR = vdwDelayUsec >> vbPscrBitData;
    ccprintf(_DEBUG_CMD_A_, ("mmTim1CalPscrCntr : vwPSCR (0x%04x) vwCNTR (0x%04x) vdwDelayUsec [0x%08lx]\r\n", *pvwPSCR, *pvwCNTR, vdwDelayUsec));
  }
  return 1;
}
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
int mmTim1GpioInit(void)
{
  /* Configures GPIOs */
  // GPIO_Configuration();
  {
    /* Configure PD0 (LED1) as output push-pull low (led switched on) */
    // GPIO_Init(UCOM_LED1_GPIO, UCOM_LED1_PIN, UCOM_LED1_MODE);
    {
      UCOM_LED1_GPIO->ODR &= (uint8_t)(~(UCOM_LED1_PIN)); /* Output mode  Low level */
      UCOM_LED1_GPIO->DDR |= (uint8_t)UCOM_LED1_PIN;      /* Set Output mode */
      UCOM_LED1_GPIO->CR1 |= (uint8_t)UCOM_LED1_PIN;      /* Push-Pull */
      // UCOM_LED1_GPIO->CR1 &= (uint8_t)(~(UCOM_LED1_PIN)); /* Open drain */
      UCOM_LED1_GPIO->CR2 |= (uint8_t)UCOM_LED1_PIN; /* 10MHz */
      // UCOM_LED1_GPIO->CR2 &= (uint8_t)(~(UCOM_LED1_PIN)); /* 2MHz */
    }
    /* Configure PA3 : KEY IN as input push-pull low (led switched on) */
    // GPIO_Init(UCOM_KEY1_GPIO, UCOM_KEY1_PIN, UCOM_KEY1_MODE);
    {
      UCOM_KEY1_GPIO->DDR &= (uint8_t)(~(UCOM_KEY1_PIN)); /* Set Input mode */
      UCOM_KEY1_GPIO->CR1 |= (uint8_t)UCOM_KEY1_PIN; /* Pull-up */
      // UCOM_KEY1_GPIO->CR1 &= (uint8_t)(~(UCOM_KEY1_PIN)); /* Float */
      // UCOM_KEY1_GPIO->CR2 |= (uint8_t)UCOM_KEY1_PIN; /* External interrupt enable */
      UCOM_KEY1_GPIO->CR2 &= (uint8_t)(~(UCOM_KEY1_PIN)); /* External interrupt disable */
    }
  }
  return 1;
}
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
void mmRemapCH1N_CH2N_CH3N_ETR(void)
{
		#define OPT2_REG 0x4803  // https://www.st.com/resource/en/datasheet/stm8s105c6.pdf  page 49
		#define AFR5_BIT 0x20  // 1 : port B0 alternate function = TIM1_CH1N.// AFR5 Alternate function remapping option 5
		// if (!strcmp(argv[2], "set"))
		{
			/* set option bytes */ 
			if(FLASH_ReadByte(OPT2_REG)!=AFR5_BIT) 
			{ 
				FLASH_Unlock(FLASH_MEMTYPE_DATA); 
				/* Enable by HW WWDG */ 
				FLASH_ProgramOptionByte(OPT2_REG,AFR5_BIT); 
			} 
			// vbData=FLASH_ReadOptionByte(OPT2_REG); 
		}
}
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
#endif // __MIB_DEBUG_TIM1__
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------
#if 0

void main(void)
{
  CLK_HSICmd(ENABLE);
  CLK_SYSCLKConfig(CLK_PRESCALER_HSIDIV1);
  GPIO_Config();
  TIM1_Config();
  while (1)
  {
    // TIM1_SetCompare1(349);
  }
}

void TIM1_Config()
{
  TIM1_DeInit();
  /* cau hinh timer 1 co dau ra PWM la 10kHz
  - bo chia tan 2
  - duty =30%
   Ftimer=16/2=8Mhz
   TimerPeriod= Ftimer/Fpwm  -1=799
  */
  TIM1_TimeBaseInit(1, TIM1_COUNTERMODE_UP, 799, 0);
  TIM1_SelectOCxM(TIM1_CHANNEL_1, TIM1_OCMODE_PWM2);
  TIM1_OC1PolarityConfig(TIM1_OCPOLARITY_LOW);
  TIM1_CCxCmd(TIM1_CHANNEL_1, ENABLE);
  TIM1_SetCompare1(239);
  TIM1_OC1PreloadConfig(ENABLE);
  TIM1_ARRPreloadConfig(ENABLE);
  /* TIM1 counter enable */
  TIM1_Cmd(ENABLE);
  /* TIM1 Main Output Enable */
  TIM1_CtrlPWMOutputs(ENABLE);
}

void GPIO_Config(void)
{
  GPIO_DeInit(GPIOB);
  GPIO_Init(GPIOB, GPIO_PIN_5, GPIO_MODE_OUT_PP_LOW_FAST);
  GPIO_DeInit(GPIOC);
  GPIO_Init(GPIOC, GPIO_PIN_6, GPIO_MODE_OUT_PP_LOW_FAST);
}
#endif